# BuiltInFailures.PropertySetElementFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..PropertySetElementFailures Class
BuiltInFailures Class Members See Also
---
Failures related to property set elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class PropertySetElementFailures
```

Visual Basic
---
```text
Public NotInheritable Class PropertySetElementFailures
```

Visual C++
---
```text
public ref class PropertySetElementFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..PropertySetElementFailures
# See Also
BuiltInFailures..::..PropertySetElementFailures Members
Autodesk.Revit.DB Namespace